/* Написать программу, которая запрашивает количество родственников в семье,
   а потом позволяет ввести имя родственника и его возраст. Программа должна
   определить самого молодого и самого старого родственника и вывести их имена
Пояснение

Нужно завести массив строк для хранения имён и два указателя: young и old, которые по мере ввода, связывать с нужными строками. Также необходимы три числовые переменные для:

Ввода текущего возраста
Хранения максимального возраста
Хранения минимального возраста
Состав

Программа должна состоять из функций:

    - main()
Файлы: main5.c.

*/